# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [3]:
a = pd.Series(np.arange(10))
print(a)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [4]:
b = pd.Series(np.random.random(10))
#print(b)
print(b*10)

0    0.135027
1    0.087458
2    8.862217
3    9.365048
4    4.038739
5    6.390280
6    2.496561
7    9.468491
8    2.681153
9    7.613650
dtype: float64

In [5]:
#to access any element:
b[5]

0.6390280277431324

In [ ]:
# we can change the index to be a,b,c,d,...
#b = pd.Series(np.random.random(10)), index = ['a', 'b', ....]
# in th e case of dictionary, panda recognises the keys as indexes and the values as entries.

In [26]:
#to add more columns in a data set  which is panel data that has several columns beside several rows, we use DataFrame 
def_ser = pd.DataFrame(np.arange(10))
def_ser

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

In [40]:
df_1 = pd.DataFrame(np.random.random((10, 10)))
df_1

,0,1,2,3,4,5,6,7,8,9
0,0.568502,0.111162,0.304332,0.662774,0.870515,0.811259,0.737829,0.700059,0.904993,0.224938
1,0.967850,0.049318,0.103304,0.393409,0.034238,0.064912,0.324388,0.878512,0.586169,0.609837
2,0.722663,0.636584,0.582482,0.912424,0.141331,0.151587,0.736874,0.848329,0.417743,0.573784
3,0.847522,0.966942,0.250688,0.170329,0.099655,0.445318,0.583486,0.277918,0.977586,0.263072
4,0.371223,0.700540,0.006289,0.102747,0.847295,0.777683,0.499658,0.896136,0.999235,0.175736
5,0.015008,0.833694,0.073938,0.905878,0.077851,0.348036,0.370634,0.929274,0.046390,0.257075
6,0.484846,0.149485,0.790908,0.703546,0.657468,0.997789,0.312512,0.076565,0.313343,0.063217
7,0.400149,0.967305,0.999333,0.906574,0.097043,0.510943,0.985467,0.184407,0.299621,0.283865
8,0.310955,0.767861,0.637177,0.978661,0.530954,0.833572,0.802768,0.206484,0.018479,0.301524
9,0.122930,0.502982,0.747694,0.387630,0.576682,0.837836,0.418005,0.052639,0.419156,0.477818

In [6]:
#the default of this function is 5, if we need otherwise, we need to specify: the top 5 rows
#df_1 = pd.DataFrame(np.random.random((10, 10)))
#def_1.head()

#the default of this function is 5, if we need otherwise, we need to specify: the bottom 5 rows
#def_1.tail()

### 2. Create a Pandas Series containing the elements of the list below.

In [47]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]
lst

[5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [51]:
c = pd.Series(lst)
c

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [52]:
c[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [63]:
e = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [65]:
data_frame = pd.DataFrame(e)
data_frame

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [66]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [97]:
data_frame1 = pd.DataFrame(e, columns=colnames)
data_frame1

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [98]:
sub_l = data_frame1[['Score_1','Score_3','Score_5']]
sub_l

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [99]:
avg = data_frame1[['Score_3']].mean(axis=0) # axis=0 refers to column and axis=1 refers to row
avg

Score_3    56.95
dtype: float64

### 8. From the original data frame, calculate the maximum Score_4 value.

In [100]:
max_ = data_frame1[['Score_4']].max(axis=0)
max_

Score_4    88.8
dtype: float64

### 9. From the original data frame, calculate the median Score 2 value.

In [113]:
data_frame1.sort_values(by=['Score_2'], inplace=True) #this is to sort the data, the "True" is to replace the new sorted table
#with the old table. 

print(data_frame1)

   Score_1  Score_2  Score_3  Score_4  Score_5
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
7     27.6     26.4     53.8     88.8     68.5
9     73.7     39.0     43.2     81.6     34.7
6     23.3     40.7     95.0     83.8     26.9
1     61.3     40.8     30.8     37.8     87.6
5     49.0     69.0      0.1     31.8     89.1
2     20.6     73.2     44.2     14.6     91.8
0     53.1     95.0     67.5     35.0     78.4
8     96.6     96.4     53.4     72.4     50.1

In [105]:
med1 = data_frame1[['Score_2']].median(axis=0) #pandas is clever, it takes the Median by sorting the values automatically,
#it means we cannot see the sorted column, but it has already been taken care of. 
med1

Score_2    40.75
dtype: float64

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [7]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [10]:
g = pd.DataFrame.from_dict(orders)
g

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [85]:
tq = g[['Quantity']].sum(axis=0)
tq

Quantity    2978
dtype: int64

In [12]:
tr = g[['Revenue']].sum(axis=0)
tr

Revenue    637.0
dtype: float64

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [15]:
max1 = g[['UnitPrice']].max(axis=0)
min1 = g[['UnitPrice']].min(axis=0)
diff = max1-min1
diff

UnitPrice    11.77
dtype: float64